[
  {
    "name": "Gryffindor",
    "president": "Minerva Mcgonagall",
    "creator": "Godric Gryffindor",
    "badge": "Kırmızı bir alanın üstünde altın sarısı bir aslan bulunur. (Bu nedenle Gryffindor’un rengi altın sarısı ve kırmızıdır.)",
    "ghost": "Sir Nicholas de Mimsy-Porpington (Neredeyse Kafasız Nick)",
    "rhyme": "Seni Gryffindor'a yollarım belki, Zamanla olursun aslanın teki, Yiğittir Gryffindor'da kalan çocuklar, Hepsinin yüreği, mangal kadar.",
    "location": "Gryffindor Kulesi’nin girişi yedinci kattadır. Giriş büyük bir pembe ipek elbise giymiş Şişman Kadın tablosunun arkasındadır. Eğer doğru parolayı biliyorsan ona söylersin, o da arkaya doğru açılarak yuvarlak girişi açığa çıkartır. Dinlenme odası rahat koltuklar, bir şömine ve birçok masa içerir. Şömine iletişim kurmak için dışarıyla bağlantılıdır fakat çok önemli bir olay olmadıkça Gryffindorlular aileleriyle iletişim kurmak için baykuş kullanırlar. Ayrıca salonda bulunan duyuru panosunda gerçekleşecek Hogsmeade gezileri, ikinci el kitap alım-satımları veya öğrencilerin bireysel Çikolata Kurbağası Kartları değişimleri veya benzeri değişimler yapılır. Kuleye çıkan iki merdiven vardır. Erkekler merdiveni üzerinde yedi yatakhane bulunur. (Her yıl için.) Kızların merdiveni üzerinde de yedi yatakhane bulunmaktadır.(Her yıl için.) Kızların merdivenlerinin üzerinde bir büyü vardır. Böylece eğer bir erkek onların merdivenlerinden yukarı çıkmaya çalışırsa birkaç adım sonra merdivenler düzleşir ve merdivenler kaydırak şeklini alır. Çıkan kişi de kayarak merdivenin başına döner."
  },
  {
    "name": "Slytherin",
    "president": "Horace Slughorn'un emekliye ayrılmasına kadar bina başkanlığındadır. Emekliye ayrılmasından sonra Severus Snape'ın müdürlük ve ilerki zamanda kaçısından sonra yeniden Horace Slughorn.",
    "creator": "Salazar Slytherin",
    "badge": "Yeşil alanın üstünde gümüş bir yılan. (Bu yüzden Slytherin renkleri gümüş ve yeşildir.) Yılan, kurucunun çatalağız olmasını ifade eder.",
    "ghost": "Kanlı Baron",
    "rhyme": "Düşersin belki de Slytherin’e sen, Bir başkadır sanki oraya giden, Amaçları için neler yapmazlar, Açıklasam bitmez sabaha kadar.",
    "location": "Slytherin ortak salonu alçak tavanlı, yeşil lambalar, sandalyeler ve her yerdeki kurukafalarla zindan gibi görünür. Gölün altına kurulmuştur."
  },
  {
    "name": "Ravenclaw",
    "president": "Profesör Filius Flitwick",
    "creator": "Rowena Ravenclaw",
    "badge": "Gece mavisi bir alanın üstünde bronz bir kartal. (Bu yüzden Ravenclaw renkleri gece mavisi ve bronzdur.)",
    "ghost": "Helena Ravenclaw, (Gri Leydi)",
    "rhyme": "Ravenclaw kısmetin belki, Oradakilerin hiç çıkmaz sesi, Mantıktır onlarca önemli olan, Öyle kurtulurlar tüm sorunlardan.",
    "location": "Ravenclaw Kulesi Şato’nun batı tarafında konumlandırılmıştır. Giriş, beşinci katta, tepede sıkıca sarmalanmış bir merdivenden gidilen bir kapıdır. Kapıda hiç kol ve anahtar girişi yoktur, ama konuşan, bronz, kartal şeklinde bir kapı tokmağı vardır. Tokmak bir soru sorar, eğer doğru cevap verirsen, tokmak cevaptaki kişiyi över ve kapı sallanarak açılır. Ortak oda, diğer ortak odalar gibi binanın renkleriyle dekore edilmiştir. (mavi ve bronz ipek duvar asmaları ve yıldızlarla dekore edilmiş bir gece-mavisi halı). Ve duvarlar, zarif kemerli camlarla çevredeki dağların, Quidditch sahasının ve seraların mükemmel görüntüsünü görmeyi sağlar. Kitaplıklar, masalar ve sandalyeler ve girişin karşısında, yatakhanelere giden başka bir kapı vardır. Bu kapının yanında, Rowena Ravenclaw’ın diademini taktığı beyaz mermer heykel bulunur."
  },
  {
    "name": "Hufflepuff",
    "president": "Profesör Pomona Sprout",
    "creator": "Helga Hufflepuff",
    "badge": "Sarı bir alanın üstünde siyah porsuk. (Bu nedenle Hufflepuff’ın renkleri kanarya sarısı ve gece siyahıdır. Ayrıca kurucu Helga Hufflepuff istediği zamanlar porsuğa dönüşebiliyordu.)",
    "ghost": "Şişman Keşiş",
    "rhyme": "Belki de düşersin Hufflepuff’a, Haksızlığı hemen kaldırıp rafa, Adalet uğruna savaş verirsin, Her yere mutluluk götürmek için.",
    "location": " Giriş yapılan portreye erişebilmek için Giriş Salonu’ndaki ana merdivenlerin sağındaki kapıdan geçmek ve kilerdeki bir fıçıya Helga Hufflepuff ritmiyle vurmak gerekir. Kişi yanlış bir şey yaparsa fıçıda sirkeye boğulur. Her ne kadar İksir Sınıfı’yla aynı seviyede olsa da İksir Sınıfı’ndan olabildiğince farklıdır. Diğer Ortak Salonlarda görebildiğimiz gibi Hufflepuff Ortak Salonu da bina renkleriyle bezenmiştir. Gryffindor Kulesi’nde olduğu gibi Hufflepuff Ortak Salonu da sarı renkli askılarla donatılmıştır ve içeride birçok konforlu koltuk bulunmaktadır. Ortak Salon her daim güneşli gibidir, dairesel pencerelerle dolu ve seraların, yeşil çimlerin görüntüsünü yakalar. Birçok tünel de bulunmaktadır. Hufflepuff çalışkanlığa, disipline, sadakâte ve arkadaşlık ilişkilerine değer veren binadır. Ambleminde porsuk bulunurken, renkleri kanarya sarısı ve gece siyahıdır. Bu binanın başkanı herboloji öğretmeni Pomona Sprout, hayaleti ise Şişman Keşiş'tir. Hufflepuff'un kurucusu Helga Hufflepuff'tır."
  }
]
